package day0108;

public class WhileFor_05 {

	public static void main(String[] args) {
		//반복문
		/*
		 * 1. while(조건식)
		 * {
		 * 		수행문장
		 * }
		 * ===>조건이 참일동안 반복실행, 조건식이 처음부터 안맞으면 한번도 실행 안함(선조건일 경우)
		 * 
		 * 2. do{
		 * 		수행문장
		 * }while(조건식);
		 * ===>조건이 참일동안 반복실행, 조건이 처음부터 안맞더라도 한번은 실행함(후조건일 경우)
		 * 
		 * 3.for(초기값; 조건식; 증감식)
		 * {
		 * 		수행문장
		 * }
		 * ===>반복횟수가 정해져 있는 경우에 많이 사용(예:배열)
		 * 초기값 실행후 조건에 맞으면 문장을 수행, 그리고 증감=>다시 조건비교=>수행
		 * 조건에 안맞으면 빠져나간다.
		 * 
		 * 4.break
		 * 현재속한 반복문을 빠져나간다.
		 * break label:
		 * label이 선언된 반복문 빠져나갈수있다.(2개이상의 반복문을 빠져나가고자 할때 사용)
		 * 
		 * 5.continue
		 * 반복문에서 continue를 만나면 남은 코드를 실행하지않고 증감식으로 이동한후 다시 조건비교하여 수행한다.
		 */

	}

}
